test_mix/twoParticlesSediment_cfdemSolverMix/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.01;

vertices
(
  (0.0 0 0)   // 0
  (0.3 0 0)   // 1
  (0.7 0 0)   // 2
  (1 0 0)  // 3

  (0.0 0.3 0)   // 4
  (0.3 0.3 0)   // 5
  (0.7 0.3 0)   // 6
  (1   0.3 0)  // 7

  (0.0 0.7 0)   // 8
  (0.3 0.7 0)   // 9
  (0.7 0.7 0)   // 10
  (1   0.7 0)  // 11

  (0.0 1 0)   // 12
  (0.3 1 0)   // 13
  (0.7 1 0)   // 14
  (1   1 0)  // 15

  (0.0 0 4)   // 16
  (0.3 0 4)   // 17
  (0.7 0 4)   // 18
  (1 0 4)  // 19

  (0.0 0.3 4)   // 20
  (0.3 0.3 4)   // 21
  (0.7 0.3 4)   // 22
  (1   0.3 4)  // 23

  (0.0 0.7 4)   // 24
  (0.3 0.7 4)   // 25
  (0.7 0.7 4)   // 26
  (1   0.7 4)  // 27

  (0.0 1 4)   // 28
  (0.3 1 4)   // 29
  (0.7 1 4)   // 30
  (1   1 4)  // 31
);

blocks          
(
  hex (0 1 5 4 16 17 21 20) (6 6 180) edgeGrading (0.5 0.5 1)  // 0
  hex (1 2 6 5 17 18 22 21) (16 6 180) edgeGrading (1 0.5 1)    // 1
  hex (2 3 7 6 18 19 23 22) (6 6 180) edgeGrading (2 0.5 1)    // 2
  hex (4 5 9 8 20 21 25 24) (6 16 180) edgeGrading (0.5 1 1)    // 3
  hex (5 6 10 9 21 22 26 25) (16 16 180) simpleGrading (1 1 1)   // 4 (centre)
  hex (6 7 11 10 22 23 27 26) (6 16 180) edgeGrading (2 1 1)    // 5
  hex (8 9 13 12 24 25 29 28) (6 6 180) edgeGrading (0.5 2 1)  // 6
  hex (9 10 14 13 25 26 30 29) (16 6 180) edgeGrading (1 2 1)   // 7
  hex (10 11 15 14 26 27 31 30) (6 6 180) edgeGrading (2 2 1)  // 8
);

edges           
(
);


patches
(
  wall inlet
  (
    (0 1 5 4)
    (1 2 6 5)
    (2 3 7 6)
    (4 5 9 8)
    (5 6 10 9)
    (6 7 11 10)
    (8 9 13 12)
    (9 10 14 13)
    (10 11 15 14)
  )
  wall wall
  (
    (0 16 20 4)
    (4 20 24 8)
    (8 24 28 12)
    (12 28 29 13)
    (13 29 30 14)
    (14 30 31 15)
    (15 31 27 11)
    (11 27 23 7)
    (7 23 19 3)
    (3 19 18 2)
    (2 18 17 1)
    (1 17 16 0)
  )
  wall outlet
  (
    (16 17 21 20)
    (17 18 22 21)
    (18 19 23 22)
    (20 21 25 24)
    (21 22 26 25)
    (22 23 27 26)
    (24 25 29 28)
    (25 26 30 29)
    (26 27 31 30)
  )
  /*
  empty frontAndBack
  (
  )
  */
);

mergePatchPairs 
(
);

